Thanks for reporting!

Interesting thought, I can't reproduce it on my test server using the provided example:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_virtual_environment_file.test_file will be created
  + resource "proxmox_virtual_environment_file" "test_file" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "pve"

      + source_file {
          + changed   = false
          + file_name = "main.tf-copy-as-snippet.txt"
          + insecure  = false
          + path      = "main.tf"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
proxmox_virtual_environment_file.test_file: Creating...
proxmox_virtual_environment_file.test_file: Creation complete after 1s [id=local:snippets/main.tf-copy-as-snippet.txt]
```

Could be related to the storage type, or whether snippets are enabled for this storage.
The provider makes an API call to get storage details, in my env it returns this for `local`:
`
2023-06-24T00:41:31.320-0400 [DEBUG] provider.terraform-provider-proxmox: Received HTTP Response: @module=proxmox Content-Length=164 Server=pve-api-daemon/3.0 tf_provider_addr=registry.terraform.io/bpg/proxmox @caller=/Users/pasha/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.26.1/helper/logging/logging_http_transport.go:159 Date="Sat, 24 Jun 2023 04:41:31 GMT" Expires="Sat, 24 Jun 2023 04:41:31 GMT" tf_http_res_version=HTTP/1.1 tf_mux_provider=tf5to6server.v5tov6Server tf_req_id=bbc2d51a-a447-05de-039d-0b1ad942ffb7 tf_resource_type=proxmox_virtual_environment_file Cache-Control=max-age=0 Content-Type=application/json;charset=UTF-8 tf_http_op_type=response tf_http_res_body={"data":{"shared":0,"type":"dir","path":"/var/lib/vz","storage":"local","digest":"2ef93499b03432022d385884f1593f2f2311729c","content":"iso,vztmpl,backup,snippets"}} tf_http_res_status_code=200 tf_rpc=ApplyResourceChange tf_http_trans_id=73879ec2-0047-1127-f53c-324189bade09 Connection=Keep-Alive Pragma=no-cache tf_http_res_status_reason="200 OK" timestamp=2023-06-24T00:41:31.320-0400
`

My suspicion is snippets cant be read back via API if they are not enabled for the storage:
<img width="943" alt="Screenshot 2023-06-24 at 12 49 57 AM" src="https://github.com/bpg/terraform-provider-proxmox/assets/627562/46ddb919-5f32-4725-a565-1f683289dbca">
